---
kind: method
id: M:Autodesk.Revit.DB.View3D.HasBeenLocked
zh: 三维视图、3d视图
source: html/8f35f96e-6c50-4cd8-c287-f13408ed9f05.htm
---
# Autodesk.Revit.DB.View3D.HasBeenLocked Method

**中文**: 三维视图、3d视图

Identifies if the view has ever been locked.

## Syntax (C#)
```csharp
public bool HasBeenLocked()
```